Repository: hosamhamdy258/the-true-validator
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: English
ar: الإنجليزية

source: Arabic
ar: العربية

source: Egyptian National ID Validator
ar: التحقق من الرقم القومي المصري

source: Test the validator instantly - No authentication required!
ar: اختبر المدقق فوراً - لا يتطلب مصادقة!

source: Test Validator
ar: اختبار المدقق

source: Egyptian National ID (14 digits)
ar: الرقم القومي المصري (14 رقم)

source: Validate ID
ar: التحقق من الرقم

source: Valid National ID
ar: رقم قومي صحيح

source: National ID
ar: الرقم القومي

source: Birth Date
ar: تاريخ الميلاد

source: Age
ar: العمر

source: years
ar: سنة

source: Gender
ar: النوع

source: Century
ar: القرن

source: Generation
ar: الجيل

source: Governorate
ar: المحافظة

source: Invalid National ID
ar: رقم قومي غير صحيح

source: Example IDs
ar: أمثلة للأرقام

source: API Documentation
ar: توثيق الواجهة البرمجية

source: Authentication
ar: المصادقة

source: Get JWT tokens first:
ar: احصل على رموز JWT أولاً:

source: Test Credentials:
ar: بيانات الاختبار:

source: Username:
ar: اسم المستخدم:

source: Password:
ar: كلمة المرور:

source: Validate National ID
ar: التحقق من الرقم القومي

source: Requires:
ar: يتطلب:

source: Interactive Docs
ar: التوثيق التفاعلي

source: Quick API Example
ar: مثال سريع للواجهة البرمجية

source: Token Management
ar: إدارة الرموز

source: Refresh your access token
ar: تحديث رمز الوصول

source: Logout / blacklist token
ar: تسجيل الخروج / إلغاء الرمز

source: Note:
ar: ملاحظة:

source: This testing page bypasses authentication for convenience. The real API requires JWT tokens for all requests.
ar: صفحة الاختبار هذه تتجاوز المصادقة للراحة. الواجهة البرمجية الحقيقية تتطلب رموز JWT لجميع الطلبات.

source: Egyptian National ID Format
ar: تنسيق الرقم القومي المصري

source: Digit 1:
ar: الرقم 1:

source: 2 = 1900s, 3 = 2000s
ar: 2 = القرن العشرين، 3 = القرن الحادي والعشرين

source: Digits 2-7:
ar: الأرقام 2-7:

source: YYMMDD format
ar: تنسيق سنة-شهر-يوم

source: Digits 8-9:
ar: الأرقام 8-9:

source: 01-35 (27 codes)
ar: 01-35 (27 كود)

source: Digits 10-13:
ar: الأرقام 10-13:

source: Serial
ar: الرقم التسلسلي

source: 13th: odd=male, even=female
ar: الرقم 13: فردي=ذكر، زوجي=أنثى

source: National ID must contain only digits
ar: يجب أن يحتوي الرقم القومي على أرقام فقط

source: 20th century (1900-1999)
ar: القرن العشرين (1900-1999)

source: 21st century (2000+)
ar: القرن الحادي والعشرين (2000+)

source: Male
ar: ذكر

source: Female
ar: أنثى

source: 14-digit Egyptian National ID number
ar: الرقم القومي المصري المكون من 14 رقم
